; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	spectrograph1 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star1 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument3 spectrograph1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 spectrograph1)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
	(supports instrument6 spectrograph1)
	(supports instrument6 spectrograph0)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
	(supports instrument7 spectrograph1)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 Star1)
	(supports instrument8 spectrograph1)
	(supports instrument8 spectrograph2)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 spectrograph1)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument10 spectrograph1)
	(supports instrument10 spectrograph2)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 GroundStation2)
	(supports instrument11 spectrograph2)
	(supports instrument11 spectrograph0)
	(supports instrument11 spectrograph1)
	(calibration_target instrument11 GroundStation0)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 Star1)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star10)
)
(:goal (and
	(pointing satellite3 Phenomenon5)
	(pointing satellite4 Star7)
	(have_image Phenomenon5 spectrograph2)
	(have_image Phenomenon6 spectrograph2)
	(have_image Star7 spectrograph2)
	(have_image Phenomenon8 spectrograph0)
	(have_image Planet9 spectrograph1)
	(have_image Star10 spectrograph2)
	(have_image Star11 spectrograph1)
))

)

; plan
1. (turn_to satellite3 groundstation3 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 9
3. (calibrate satellite3 instrument8 groundstation3)
   added: (calibrated instrument8)
   goals met: 0 of 9
4. (turn_to satellite3 star10 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 star10)
   goals met: 0 of 9
5. (take_image satellite3 star10 instrument8 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 1 of 9
6. (turn_to satellite3 planet9 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 planet9)
   goals met: 1 of 9
7. (take_image satellite3 planet9 instrument8 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 2 of 9
8. (turn_to satellite3 phenomenon8 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 phenomenon8)
   goals met: 2 of 9
9. (take_image satellite3 phenomenon8 instrument8 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 3 of 9
10. (turn_to satellite3 phenomenon6 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 phenomenon6)
   goals met: 3 of 9
11. (take_image satellite3 phenomenon6 instrument8 spectrograph2)
   added: (have_image phenomenon6 spectrograph2)
   goals met: 4 of 9
12. (turn_to satellite3 star11 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 star11)
   goals met: 4 of 9
13. (take_image satellite3 star11 instrument8 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 5 of 9
14. (turn_to satellite3 star7 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star7)
   goals met: 5 of 9
15. (take_image satellite3 star7 instrument8 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 6 of 9
16. (turn_to satellite3 phenomenon5 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 phenomenon5)
   goals met: 7 of 9
17. (take_image satellite3 phenomenon5 instrument8 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 8 of 9
18. (turn_to satellite4 star7 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 star7)
   goals met: 9 of 9
